app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "pets".* FROM "pets"
---
  def index
    @user = User.find (session[:user_id]) if user_signed_in?
    @pets = Pet.all