app/controllers/messages_controller.rb

   def create
    @message = Message.new message_params
    @message.user = current_user
    respond_to do |format|
    if @message.save
---
INSERT INTO "messages" ("body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "jhjhjkhkj"], ["created_at", 2016-11-21 23:39:37 UTC], ["updated_at", 2016-11-21 23:39:37 UTC], ["user_id", 4]]