app/controllers/pets_controller.rb

  def find_pet
    @pet = Pet.find params[:id]
---
SELECT "pets".* FROM "pets"